<center>

### Capítulo 2

</center>

Ahora nosotros nos encargaremos de cumplir una promesa anterior: ya sabemos claramente cómo crear una base de datos y agregarle datos, así que el siguiente paso lógico es **obtener esa información desde Python** para poder manipularla usando **Pandas**.

Para ello, utilizaremos la misma base de datos creada en el capítulo 1.  
Pero antes de comenzar, vamos a entender con calma los comandos `SELECT` y `FROM`.

---

##### SELECT y FROM

El comando `SELECT` nos permite seleccionar los datos de una tabla. Para usarlo, debemos indicar qué columnas queremos consultar.  
Por otro lado, el comando `FROM` nos dice **de qué tabla** queremos obtener los datos.

Si queremos ver **toda la información** de una tabla, usamos el asterisco `*` como comodín.  
Por ejemplo, supongamos que nuestra base de datos se llama `mi_base.db` y contiene una tabla llamada `empleados`.  
Podemos obtener todo el contenido de esa tabla con la siguiente consulta SQL:

```sql
SELECT * FROM empleados;
```
Esta instrucción nos devolverá todas las filas y columnas de la tabla empleados.
Ahora bien, vamos a ejecutar esta misma consulta desde Python utilizando Pandas. Para eso usamos la función pd.read_sql_query:

```python
df = pd.read_sql_query("SELECT * FROM empleados", conn)
```
- df es la variable donde guardaremos el resultado, un DataFrame de Pandas.

- "SELECT * FROM empleados" es la consulta SQL que ya explicamos.

- conn es la conexión a la base de datos que configuramos previamente en el capítulo 1.

El ejemplo completo se encuentra en el siguiente código:

In [2]:
import sqlite3
import pandas as pd

#Conectar a la base de datos

conn = sqlite3.connect('mi_base.db') 
df = pd.read_sql_query("SELECT * FROM empleados", conn) 
df

   id nombre  edad  salario
0   1    Ana    30  40000.0
1   2   Luis    25  38000.0
2   3  Sofía    35  52000.0
3   4  Pedro    28  45000.0

Podemos adquirir aún más información gracias a condicionar la consulta de la tabla, es decir, podemos filtrar los datos que queremos obtener usando una condición de búsqueda `WHERE`.

También podemos usar operadores de comparación y operadores lógicos para filtrar los datos, estos son los siguientes:
```sql
SELECT * FROM empleados WHERE edad = 30;
SELECT * FROM empleados WHERE salario != 50000;
SELECT * FROM empleados WHERE salario > 60000;
SELECT * FROM empleados WHERE edad >= 3;
SELECT * FROM empleados WHERE edad > 30 AND salario > 50000;
SELECT * FROM empleados WHERE edad < 25 OR salario > 70000;
SELECT * FROM empleados WHERE NOT (edad > 40);
```

<center>

### Ejercicio 1

</center>

Escribe una consulta SQL que seleccione solo a los empleados que ganan más de 40,000.

In [18]:
df_filtrado1 = pd.read_sql_query("SELECT * FROM empleados WHERE salario > 40000", conn)

df_filtrado1

   id nombre  edad  salario
0   3  Sofía    35  52000.0
1   4  Pedro    28  45000.0

<center>

### Ejercicio 2

</center>

Escribe una consulta SQL que seleccione solo a los empleados que ganan más de 20,000 y tienen una edad menor de 30.

In [20]:
df_filtrado2 = pd.read_sql_query("SELECT * FROM empleados WHERE salario > 20000 AND edad < 30", conn)

df_filtrado2

   id nombre  edad  salario
0   2   Luis    25  38000.0
1   4  Pedro    28  45000.0

#### Nota

En lo anterior hemos utilizado pandas, para poder acceder de forma más natural, pero python sin libreria nos permita hacer consulta de esta data usando

In [4]:
cursor = conn.cursor()
data = cursor.execute("SELECT * FROM empleados") 
for row in data: 
    print(row)

(1, 'Ana', 30, 40000.0)
(2, 'Luis', 25, 38000.0)
(3, 'Sofía', 35, 52000.0)
(4, 'Pedro', 28, 45000.0)